Config/InformationRegisters/ИменаРеквизитовДокументовДляВыбораОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИменаРеквизитовДокументовДляВыбораОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ЗначенияКолонокДополнительныхТабличныхЧастей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияКолонокДополнительныхТабличныхЧастей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыОпераций</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеТабличныеЧастиДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КолонкаТабличнойЧасти</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КолонкиДополнительныхТабличныхЧастей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ДанныеПоставляемыхТиповыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПоставляемыхТиповыхОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормулаДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормулаСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормулаОрганизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СхемаФормированияПроводок</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуетсяВнешняяПроцедура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяВнешнейПроцедуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаПредставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СхемаПроверкиУсловия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщенияПриОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловиеИспользования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбработчикПослеФормирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставляемыеТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ВерсииПоставляемыхТиповыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерсииПоставляемыхТиповыхОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоставляемаяТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставляемыеТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/СостоянияПоддержкиТиповыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияПоддержкиТиповыхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеРедактируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактируетсяССохранениемПоддержки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактируетсяБезСохраненияПоддержки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ТиповыеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТиповыеОперации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьБлокировку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляемаяТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставляемыеТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПоддержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПоддержкиТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеПользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравоИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/КолонкиДополнительныхТабличныхЧастей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КолонкиДополнительныхТабличныхЧастей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ДополнительныеТабличныеЧастиДокументов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяКолонки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеТипаКолонки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязиПараметровВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязьПоТипу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаЭлементов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСвязиПараметровВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборЭлементов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ПоставляемыеТиповыеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПоставляемыеТиповыеОперации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьБлокировку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределеннойОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержкиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/БухгалтерскиеОперацииПовтИспНаВремяСеанса/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ИменаРеквизитовДляПроверкиИспользованияОперации(ИдентификаторДокумента) Экспорт

	ПараметрыИспользования = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИменаРеквизитовДокументовДляВыбораОпераций.ИмяРеквизита КАК ИмяРеквизита
	|ИЗ
	|	РегистрСведений.ИменаРеквизитовДокументовДляВыбораОпераций КАК ИменаРеквизитовДокументовДляВыбораОпераций
	|ГДЕ
	|	ИменаРеквизитовДокументовДляВыбораОпераций.ИдентификаторДокумента = &ИдентификаторДокумента
	|	И ИменаРеквизитовДокументовДляВыбораОпераций.ИмяРеквизита <> """"";
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыИспользования.Вставить(Выборка.ИмяРеквизита);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПараметрыИспользования) Тогда
		Возврат Новый ФиксированнаяСтруктура(ПараметрыИспользования);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ЕстьПравоПросмотраПроводокДокументов() Экспорт

	Возврат ПравоДоступа("Чтение", Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ)
		И ПравоДоступа("Просмотр", Метаданные.Обработки.ФормированиеБухгалтерскихПроводок);

КонецФункции // ЕстьПравоПросмотраПроводокДокументов()

Функция ПараметрыИспользованияОперацийИДопРеквизитов(ИдентификаторДокумента) Экспорт

	Результат = Новый Структура("ТиповыеОперации, ТабличныеЧасти", Ложь, Ложь);
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(Т1.ТиповыеОперации, ЛОЖЬ) КАК ТиповыеОперации,
	               |	ЕСТЬNULL(Т2.ТабличныеЧасти, ЛОЖЬ) КАК ТабличныеЧасти
	               |ИЗ
	               |	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	               |			ИСТИНА КАК ТиповыеОперации
	               |		ИЗ
	               |			Справочник.ТиповыеОперации КАК ТиповыеОперации
	               |		ГДЕ
	               |			ТиповыеОперации.ИдентификаторДокумента = &ИдентификаторДокумента
	               |			И НЕ ТиповыеОперации.НеИспользуется
	               |			И НЕ ТиповыеОперации.ПометкаУдаления) КАК Т1
	               |		ПО Истина
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	               |			ИСТИНА КАК ТабличныеЧасти
	               |		ИЗ
	               |			Справочник.КолонкиДополнительныхТабличныхЧастей КАК КолонкиДополнительныхТабличныхЧастей
	               |		ГДЕ
	               |			КолонкиДополнительныхТабличныхЧастей.Владелец.ИдентификаторДокумента = &ИдентификаторДокумента
	               |			И НЕ КолонкиДополнительныхТабличныхЧастей.Владелец.ПометкаУдаления
	               |			И НЕ КолонкиДополнительныхТабличныхЧастей.ПометкаУдаления) КАК Т2
	               |		ПО Истина
	               |ГДЕ
	               |	ИдентификаторыОбъектовМетаданных.Ссылка = &ИдентификаторДокумента";
				   
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПараметрыИспользованияОперацийИДопРеквизитов()

Функция ПоДокументуВедетсяВалютныйУчет(Идентификатор) Экспорт
	
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Идентификатор);
	Возврат МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено
			И МетаданныеДокумента.Реквизиты.Найти("Курс")=Неопределено;
	
КонецФункции

// Проверяет наличие в документе реквизита ПервичныйДокумент с типом СправочникСсылка.ПервичныеДокументы
//
// Параметры:
//  Идентификатор - СправочникСсылка.ИдентификаторыОбъектовМетаданных
// 
// Возвращаемое значение:
//  Булево
//
Функция ВДокументеЕстьПервичныйДокумент(Идентификатор) Экспорт
	ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Идентификатор);
	РеквизитПервичныйДокумент = ОбъектМетаданных.Реквизиты.Найти("ПервичныйДокумент");
	Возврат РеквизитПервичныйДокумент <> Неопределено
		И ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(
			РеквизитПервичныйДокумент.Тип, Тип("СправочникСсылка.ПервичныеДокументы"));
КонецФункции

Функция ДеревоЭлементовФормыДополнительныхТабличныхЧастей(ИдентификаторДокумента) Экспорт

	Результат = БухгалтерскиеОперацииРаботаСФормами.ПустоеДеревоЭлементовФормы();
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КолонкиДополнительныхТабличныхЧастей.Владелец.Наименование КАК ЗаголовокТЧ,
	|	КолонкиДополнительныхТабличныхЧастей.Владелец.ИмяТабличнойЧасти КАК ИмяТЧ,
	|	КолонкиДополнительныхТабличныхЧастей.ЭтоГруппа,
	|	КолонкиДополнительныхТабличныхЧастей.Владелец.ПредопределеннаяТабличнаяЧасть КАК ПредопределеннаяТЧ,
	|	КолонкиДополнительныхТабличныхЧастей.Наименование КАК ЗаголовокРеквизита,
	|	КолонкиДополнительныхТабличныхЧастей.ИмяКолонки КАК ИмяРеквизита,
	|	КолонкиДополнительныхТабличныхЧастей.ОписаниеТипаКолонки.ТипЗначения КАК ТипЗначенияРеквизита,
	|	КолонкиДополнительныхТабличныхЧастей.СвязиПараметровВыбора,
	|	КолонкиДополнительныхТабличныхЧастей.ПараметрыВыбора,
	|	КолонкиДополнительныхТабличныхЧастей.СвязьПоТипу,
	|	КолонкиДополнительныхТабличныхЧастей.Обязательный КАК ОбязательныйРеквизит,
	|	КолонкиДополнительныхТабличныхЧастей.Родитель КАК Родитель,
	|	КолонкиДополнительныхТабличныхЧастей.Ссылка КАК Ссылка,
	|	КолонкиДополнительныхТабличныхЧастей.ОтборЭлементов,
	|	КолонкиДополнительныхТабличныхЧастей.ГруппировкаЭлементов,
	|	КолонкиДополнительныхТабличныхЧастей.ВидЭлемента
	|ИЗ
	|	Справочник.КолонкиДополнительныхТабличныхЧастей КАК КолонкиДополнительныхТабличныхЧастей
	|ГДЕ
	|	КолонкиДополнительныхТабличныхЧастей.Владелец.ИдентификаторДокумента = &ИдентификаторДокумента
	|	И НЕ КолонкиДополнительныхТабличныхЧастей.ПометкаУдаления
	|	И НЕ КолонкиДополнительныхТабличныхЧастей.Владелец.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	КолонкиДополнительныхТабличныхЧастей.Владелец.Код,
	|	КолонкиДополнительныхТабличныхЧастей.Код
	|ИТОГИ ПО
	|	КолонкиДополнительныхТабличныхЧастей.Владелец,
	|	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Для каждого ВыборкаТЧ Из Дерево.Строки Цикл
	
		ТабличнаяЧасть = Результат.Строки.Добавить();
		ТабличнаяЧасть.Имя 						= ВыборкаТЧ.ИмяТЧ;
		ТабличнаяЧасть.Заголовок 				= ВыборкаТЧ.ЗаголовокТЧ;
		ТабличнаяЧасть.РастягиватьПоГоризонтали	= Истина;
		ТабличнаяЧасть.ТипЭлемента 				= Новый ОписаниеТипов("ТаблицаФормы");
		ТабличнаяЧасть.ВидЭлемента 				= Неопределено;
		ТабличнаяЧасть.Валютный 				= Ложь;
		ТабличнаяЧасть.НеПовторять 				= Истина;
		ТабличнаяЧасть.ПредопределеннаяТЧ		= ВыборкаТЧ.ПредопределеннаяТЧ;
		ТабличнаяЧасть.ЦветФона					= Новый Цвет;
		
		ДобавитьРекурсивноЭлементыДополнительнойТабличнойЧасти(ВыборкаТЧ, ТабличнаяЧасть, Неопределено);
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДеревоЭлементовФормыТиповойОперации(ТиповаяОперация, ИдентификаторДокумента) Экспорт
	
	Возврат БухгалтерскиеОперацииРаботаСФормами.ДеревоЭлементовФормыТиповойОперации(ТиповаяОперация, ИдентификаторДокумента);
	
КонецФункции

Функция ПараметрыПолученияСохраненныхЗначенийТабличныхЧастей(ИдентификаторДокумента) Экспорт

	ПараметрыПолученияСохраненныхЗначений = Новый Структура;
	
	МассивЗапросов 		= Новый Массив;
	МассивИменТЧ 		= Новый Массив;
	ПараметрыЗапроса	= Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.Владелец КАК ТабличнаяЧастьДокумента,
	               |	Т.Владелец.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	               |	Т.Владелец.ПредопределеннаяТабличнаяЧасть КАК ПредопределеннаяТабличнаяЧасть,
	               |	Т.Ссылка КАК РеквизитТабличнойЧасти,
	               |	Т.ИмяКолонки КАК ИмяРеквизита
	               |ИЗ
	               |	Справочник.КолонкиДополнительныхТабличныхЧастей КАК Т
	               |ГДЕ
	               |	Т.Владелец.ИдентификаторДокумента = &ИдентификаторДокумента
	               |	И НЕ Т.ПометкаУдаления
	               |	И НЕ Т.Владелец.ПометкаУдаления
	               |	И НЕ Т.ЭтоГруппа
	               |ИТОГИ ПО
	               |	ТабличнаяЧастьДокумента";
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	ВыборкаТЧ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СчетчикТЧ 			= 0;
	СчетчикРеквизитов 	= 0;
	Пока ВыборкаТЧ.Следующий() Цикл
		СчетчикТЧ	= СчетчикТЧ + 1;
		МассивИменТЧ.Добавить(Новый Структура("ИмяТабличнойЧасти, ПредопределеннаяТабличнаяЧасть",
												ВыборкаТЧ.ИмяТабличнойЧасти,
												ВыборкаТЧ.ПредопределеннаяТабличнаяЧасть));
		
		ПараметрыЗапроса.Вставить("ТабличнаяЧасть" + СчетчикТЧ, ВыборкаТЧ.ТабличнаяЧастьДокумента);
		
		ПоляЗапроса = "";
		
		ТекстЗапроса = "";
		ВыборкаРеквизитов = ВыборкаТЧ.Выбрать();
		Пока ВыборкаРеквизитов.Следующий() Цикл
			СчетчикРеквизитов = СчетчикРеквизитов + 1;
			ТекстЗапроса = ТекстЗапроса + "
		               |		ЛЕВОЕ СОЕДИНЕНИЕ СохраненныеЗначения КАК СохраненныеЗначения" + СчетчикРеквизитов + "
		               |		ПО ВложенныйЗапрос.НомерСтрокиДокумента = СохраненныеЗначения" + СчетчикРеквизитов + ".НомерСтрокиДокумента
		               |			И (СохраненныеЗначения" + СчетчикРеквизитов + ".ТабличнаяЧасть = &ТабличнаяЧасть" + СчетчикТЧ + ")
		               |			И (СохраненныеЗначения" + СчетчикРеквизитов + ".РеквизитТабличнойЧасти = &РеквизитТабличнойЧасти" + СчетчикРеквизитов + ")";
			ПараметрыЗапроса.Вставить("РеквизитТабличнойЧасти" + СчетчикРеквизитов, ВыборкаРеквизитов.РеквизитТабличнойЧасти);
			ПоляЗапроса = ПоляЗапроса + ", СохраненныеЗначения" + СчетчикРеквизитов + ".ЗначениеРеквизита Как " + ВыборкаРеквизитов.ИмяРеквизита;	
					   
		КонецЦикла;
			
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВложенныйЗапрос.НомерСтрокиДокумента" + ПоляЗапроса + "
		               |ИЗ
		               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |		СохраненныеЗначения.НомерСтрокиДокумента КАК НомерСтрокиДокумента
		               |	ИЗ
		               |		СохраненныеЗначения КАК СохраненныеЗначения
		               |	ГДЕ
		               |		СохраненныеЗначения.ТабличнаяЧасть = &ТабличнаяЧасть" + СчетчикТЧ + ") КАК ВложенныйЗапрос" 
					   + ТекстЗапроса + "
					   |УПОРЯДОЧИТЬ ПО
					   |	ВложенныйЗапрос.НомерСтрокиДокумента";
		
		МассивЗапросов.Добавить(ТекстЗапроса);
	
	КонецЦикла;
	
	Если МассивЗапросов.Количество() = 0 Тогда
		Возврат ПараметрыПолученияСохраненныхЗначений;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Т.ТабличнаяЧасть,
	               |	Т.КолонкаТабличнойЧасти Как РеквизитТабличнойЧасти,
	               |	Т.НомерСтрокиДокумента,
	               |	Т.Значение Как ЗначениеРеквизита
	               |ПОМЕСТИТЬ СохраненныеЗначения
	               |ИЗ
	               |	РегистрСведений.ЗначенияКолонокДополнительныхТабличныхЧастей КАК Т
	               |ГДЕ
	               |	Т.Объект = &Документ";
	Для каждого ТекЗапрос Из МассивЗапросов Цикл
	
		ТекстЗапроса = ТекстЗапроса + "
	               |;
				   |" + ТекЗапрос;
	
	КонецЦикла;
			   
	ПараметрыПолученияСохраненныхЗначений.Вставить("ТекстЗапроса", 		ТекстЗапроса);
	ПараметрыПолученияСохраненныхЗначений.Вставить("ТабличныеЧасти", 	МассивИменТЧ);
	ПараметрыПолученияСохраненныхЗначений.Вставить("ПараметрыЗапроса",	ПараметрыЗапроса);
	
	Возврат ПараметрыПолученияСохраненныхЗначений;

КонецФункции // ПолучитьПараметрыПолученияСохраненныхЗначений()

Функция СохраненныеДанныеПоставляемойТиповойОперации(ТиповаяОперация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.ФормулаДата, """") КАК ФормулаДата,
	               |	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.ФормулаОрганизация, """") КАК ФормулаОрганизация,
	               |	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.Условие, """") КАК Условие,
	               |	ДанныеПоставляемыхТиповыхОпераций.СхемаФормированияПроводок,
	               |	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.ИспользуетсяВнешняяПроцедура, ЛОЖЬ) КАК ИспользуетсяВнешняяПроцедура,
	               |	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.ИмяВнешнейПроцедуры, """") КАК ИмяВнешнейПроцедуры,
	               |	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.НастройкаПредставления, """") КАК НастройкаПредставления,
	               |	ДанныеПоставляемыхТиповыхОпераций.СхемаПроверкиУсловия,
	               |	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.ТекстСообщенияПриОшибке, """") КАК ТекстСообщенияПриОшибке
	               |ИЗ
	               |	Справочник.ПоставляемыеТиповыеОперации КАК ПоставляемыеТиповыеОперации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоставляемыхТиповыхОпераций КАК ДанныеПоставляемыхТиповыхОпераций
	               |		ПО ПоставляемыеТиповыеОперации.Ссылка = ДанныеПоставляемыхТиповыхОпераций.ТиповаяОперация
	               |ГДЕ
	               |	ПоставляемыеТиповыеОперации.Ссылка = &ТиповаяОперация";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);				   
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка[0]);

КонецФункции // СохраненныеДанныеПоставляемойТиповойОперации()

Функция СхемаКомпоновкиДанныхДляОтбораТиповыхОпераций(ИдентификаторДокумента) Экспорт

	ОписанияРеквизитов = БухгалтерскиеОперацииПовтИспНаВремяСеанса.ПустойИсточникДанныхИзШапкиОбъекта(ИдентификаторДокумента);
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СхемаКомпоновки.ИсточникиДанных.Добавить();
	ИсточникДанных.ТипИсточникаДанных = "local";
	ИсточникДанных.Имя = "ИсточникДанных1";
	
	СчетчикТаблиц = 1;
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	НаборДанных.Имя = "Запрос";
	НаборДанных.Запрос = 
	"ВЫБРАТЬ
	|	ТиповыеОперации.Ссылка КАК ТиповаяОперация,
	|	ТиповыеОперации.Наименование КАК Наименование,
	|	ТиповыеОперации.НеИспользуется,
	|	ТиповыеОперации.ПоставляемаяТиповаяОперация.Поставщик Как Поставщик,
	|	ВЫБОР
	|		КОГДА ТиповыеОперации.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)
	|			ТОГДА 0
	|		КОГДА ТиповыеОперации.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.РедактируетсяССохранениемПоддержки)
	|			ТОГДА 1
	|		КОГДА ТиповыеОперации.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.РедактируетсяБезСохраненияПоддержки)
	|			ТОГДА 2
	|		ИНАЧЕ -1
	|	КОНЕЦ Как КартинкаСостояниеПоддержки,
	|	ТиповыеОперации.ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					Справочник.ТиповыеОперации.РазрешенныеПользователи КАК ТиповыеОперацииРазрешенныеПользователи
	|				ГДЕ
	|					ТиповыеОперацииРазрешенныеПользователи.Ссылка = ТиповыеОперации.Ссылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьПравоВсеПользователи,
	|	ВЫБОР
	|		КОГДА ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					Справочник.ТиповыеОперации.РазрешенныеПользователи КАК ТиповыеОперацииРазрешенныеПользователи
	|				ГДЕ
	|					ТиповыеОперацииРазрешенныеПользователи.Ссылка = ТиповыеОперации.Ссылка
	|					И ТиповыеОперацииРазрешенныеПользователи.Пользователь = &ТекущийПользователь)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьПравоТекущийПользователь,
	|	&ДополнительныеПоля КАК ДополнительныеПоля
	|ИЗ
	|	#ИсточникВыборки КАК ТиповыеОперации
	|ГДЕ
	|	ТиповыеОперации.ИдентификаторДокумента = &ИдентификаторДокумента
	|";
	
	ДополнительныеПоля = Новый Массив; // Массив из Строка
	ИсточникиЗапроса = Новый Массив; // Массив из Строка
	ИсточникиЗапроса.Добавить("Справочник.ТиповыеОперации КАК ТиповыеОперации");
	Для каждого РеквизитДокумента Из ОписанияРеквизитов Цикл
		ТекстПоля = "";
		ТекстИсточника = "";
		ВычислитьТекстПоляИИсточникДляОтбораТиповыхОпераций(СхемаКомпоновки, СчетчикТаблиц, РеквизитДокумента,
			ТекстПоля, ТекстИсточника);
		Если ТекстПоля <> "" Тогда
			ДополнительныеПоля.Добавить(ТекстПоля);
		КонецЕсли;
		Если ТекстИсточника <> "" Тогда
			ИсточникиЗапроса.Добавить(ТекстИсточника);
		КонецЕсли;
	КонецЦикла;
						 
	НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос,
		"#ИсточникВыборки КАК ТиповыеОперации",
		СтрСоединить(ИсточникиЗапроса, Символы.ПС));
	Если ДополнительныеПоля.Количество() > 0 Тогда
		НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос,
			"&ДополнительныеПоля КАК ДополнительныеПоля",
			СтрСоединить(ДополнительныеПоля, "," + Символы.ПС));
	Иначе
		НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос,
			"&ДополнительныеПоля КАК ДополнительныеПоля",
			"НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	
	ПараметрСхемы = СхемаКомпоновки.Параметры.Добавить();
	ПараметрСхемы.Имя						= "ИдентификаторДокумента";
	ПараметрСхемы.ТипЗначения				= Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных");
	ПараметрСхемы.ОграничениеИспользования	= Истина;
	ПараметрСхемы.ВключатьВДоступныеПоля	= Ложь;
	ПараметрСхемы.Значение					= ИдентификаторДокумента;
	
	ПараметрСхемы = СхемаКомпоновки.Параметры.Добавить();
	ПараметрСхемы.Имя						= "ТекущийПользователь";
	ПараметрСхемы.ТипЗначения				= Новый ОписаниеТипов("СправочникСсылка.Пользователи");
	ПараметрСхемы.ВключатьВДоступныеПоля	= Ложь;
	ПараметрСхемы.ОграничениеИспользования	= Истина;
	ПараметрСхемы.Значение					= Пользователи.ТекущийПользователь();
	
	Возврат СхемаКомпоновки;

КонецФункции // СхемаКомпоновкиДанныхДляОтбораТиповыхОпераций()

Функция ПустойИсточникДанныхИзШапкиОбъекта(ИдентификаторДокумента) Экспорт
	
	ИменаРеквизитов	= БухгалтерскиеОперацииПовтИспНаВремяСеанса.ИменаРеквизитовДляВыбораТиповойОперации(ИдентификаторДокумента);
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(254))); 
	ТаблицаЗначений.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("ОписаниеТипов")); 
	
	Для каждого ТекРеквизит Из ИменаРеквизитов Цикл
	
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.ИмяРеквизита = ТекРеквизит;
		НоваяСтрока.ТипЗначения = ТипЗначенияРеквизитаМетаданного(МетаданныеДокумента, ТекРеквизит);
	
	КонецЦикла; 
	
	Возврат ТаблицаЗначений;

КонецФункции

Функция ИменаРеквизитовДляВыбораТиповойОперации(ИдентификаторДокумента) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИменаРеквизитовДокументовДляВыбораОпераций.ИмяРеквизита КАК ИмяРеквизита,
	|	НЕОПРЕДЕЛЕНО КАК ТипЗначения
	|ИЗ
	|	РегистрСведений.ИменаРеквизитовДокументовДляВыбораОпераций КАК ИменаРеквизитовДокументовДляВыбораОпераций
	|ГДЕ
	|	ИменаРеквизитовДокументовДляВыбораОпераций.ИдентификаторДокумента = &ИдентификаторДокумента
	|	И ИменаРеквизитовДокументовДляВыбораОпераций.ИмяРеквизита <> """"";
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяРеквизита");
КонецФункции

Функция ВерсииМакетовТиповыхОпераций52() Экспорт

	Возврат РегистрыСведений.ВерсииПоставляемыхТиповыхОпераций.ВерсииМакетовТиповыхОпераций52();

КонецФункции

// Документы, по которым проводки всегда формируются одновременно с проведением документа,
// независимо от значения константы ФормированиеПроводокПриПроведенииДокумента.
// Не включает документ "ОперацияБух", т.к. он не проводится.
//
// Возвращемое значение:
// - ФиксированныйМассив - идентификаторы объектов (СправочникСсылка.ИдентификаторыОбъектовМетаданных)
//
Функция ДокументыФормирующиеПроводкиВсегдаОдновременно() Экспорт

	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ОперацияБух"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ЗакрытиеГода"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ЗакрытиеГодаТехнологическое"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ЗакрытиеГодаТехнологическоеГрупповое"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ЗакрытиеЗабалансовыхСчетовПоступленийИВыбытийДенежныхСредств"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ЗакрытиеСчетовСанкционирования"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ПереносПоказателейПоСанкционированию"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ФормированиеОстатковПоРасчетам"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ЗакрытиеОстатковПоЖурналамСлужебный"));

	ИОМ = ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(ТипыДокументов);
	
	Результат = Новый Массив;
	Для Каждого ТекущийИОМ Из ИОМ Цикл
		Результат.Добавить(ТекущийИОМ.Значение);		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Результат);

КонецФункции

Функция СчетПоКодуИНачалуДействия(КодСчета, ДатаНачалаДействия) Экспорт
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Код = &Код";
	Запрос.УстановитьПараметр("Код", КодСчета);
	Если ДатаНачалаДействия <> Неопределено Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ЕПСБУ.ДатаНачалаДействия = &ДатаНачалаДействия";
		Запрос.УстановитьПараметр("ДатаНачалаДействия", ДатаНачалаДействия);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
КонецФункции

#Область РаботаСИсточникамиДанных

// Возвращает структуру, содержащую имена модулей функций типовых операций, функций источников данных
// и процедур обработчиков после формирования проводок. Возвращаемое значение содержит структуры,
// в которых "ключ" - имя модуля, "значение" - описание подсистемы или расширения.
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - содержит ключи:
//		*Функции - Фиксированная структура - имена модулей функций типовых операций.
//		*ИсточникиДанных - Фиксированная структура - имена модулей функций дополнительных источников данных.
//		*Обработчики - Фиксированная структура - имена модулей процедур обработчиков после формирования проводок.
//
Функция ИменаМодулей() Экспорт
	
	ОписанияДополнительныхМодулей = Новый Массив;
	БухгалтерскиеОперацииПереопределяемый.ИменаМодулейОбъявленияФункций(ОписанияДополнительныхМодулей);
	
	ОписанияФункций           = Новый Структура;
	ОписанияИсточниковДанных  = Новый Структура;
	ОписанияОбработчиков      = Новый Структура;
	ОписанияМодулейПроведения = Новый Структура;
	
	ШаблонТекстаИсключения = НСтр("ru = 'Не найден общий модуль ""%1"" в подключенном расширении ""%2"".
		|%ПояснениеНазначенияМодуля%.
		|
		|Для продолжения работы необходимо отключить расширение
		|или исправить имя модуля и переподключить расширение снова'");
	
	ИсключениеМодулиФункций = СтрЗаменить(ШаблонТекстаИсключения, "%ПояснениеНазначенияМодуля%",
		НСтр("ru = 'Этот модуль содержит функции для использования в настройках типовых операций'"));
	ИсключениеМодулиИсточниковДанных = СтрЗаменить(ШаблонТекстаИсключения, "%ПояснениеНазначенияМодуля%",
		НСтр("ru = 'Этот модуль используется для формирования дополнительных источников типовых операций'"));
	ИсключениеМодулиОбработчиков = СтрЗаменить(ШаблонТекстаИсключения, "%ПояснениеНазначенияМодуля%",
		НСтр("ru = 'Этот модуль используется для формирования дополнительных источников типовых операций'"));
	ИсключениеМодулиПроведения = СтрЗаменить(ШаблонТекстаИсключения, "%ПояснениеНазначенияМодуля%",
		НСтр("ru = 'В этом модуле описаны процедуры проведения документов'"));
		
	Для Каждого ОписаниеМодуля Из ОписанияДополнительныхМодулей Цикл
		
		Для Каждого ТекИмяМодуля Из ОписаниеМодуля.МодулиФункций Цикл
			
			Если ИнициализироватьОбщийМодуль(ТекИмяМодуля, ИсключениеМодулиФункций, ОписаниеМодуля.Заголовок) Тогда
				ОписанияФункций.Вставить(ТекИмяМодуля, ОписаниеМодуля.Заголовок);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ТекИмяМодуля Из ОписаниеМодуля.МодулиИсточниковДанных Цикл
			
			Если ИнициализироватьОбщийМодуль(ТекИмяМодуля, ИсключениеМодулиИсточниковДанных, ОписаниеМодуля.Заголовок) Тогда
				ОписанияИсточниковДанных.Вставить(ТекИмяМодуля, ОписаниеМодуля.Заголовок);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ТекИмяМодуля Из ОписаниеМодуля.МодулиОбработчиков Цикл
			
			Если ИнициализироватьОбщийМодуль(ТекИмяМодуля, ИсключениеМодулиОбработчиков, ОписаниеМодуля.Заголовок) Тогда
				ОписанияОбработчиков.Вставить(ТекИмяМодуля, ОписаниеМодуля.Заголовок);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ТекИмяМодуля Из ОписаниеМодуля.МодулиПроведения Цикл
			
			Если ИнициализироватьОбщийМодуль(ТекИмяМодуля, ИсключениеМодулиПроведения, ОписаниеМодуля.Заголовок) Тогда
				ОписанияМодулейПроведения.Вставить(ТекИмяМодуля, ОписаниеМодуля.Заголовок);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ИменаМодулей = Новый Структура("Функции, ИсточникиДанных, Обработчики, ФункцииПроведения");
	ИменаМодулей.Функции           = Новый ФиксированнаяСтруктура(ОписанияФункций);
	ИменаМодулей.ИсточникиДанных   = Новый ФиксированнаяСтруктура(ОписанияИсточниковДанных);
	ИменаМодулей.Обработчики       = Новый ФиксированнаяСтруктура(ОписанияОбработчиков);
	ИменаМодулей.ФункцииПроведения = Новый ФиксированнаяСтруктура(ОписанияМодулейПроведения);
	
	Возврат Новый ФиксированнаяСтруктура(ИменаМодулей);
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела.
Функция ВДокументеЕстьИдентфикаторПервичногоДокумента(Идентификатор) Экспорт
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Идентификатор);
	Возврат ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("ИдентификаторПечатнойФормы", МетаданныеДокумента)
		И ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("ПредставлениеПечатнойФормы", МетаданныеДокумента);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ВычислитьТекстПоляИИсточникДляОтбораТиповыхОпераций(СхемаКомпоновки, СчетчикТаблиц, РеквизитДокумента, ТекстПоля, ТекстИсточника)

	ИменаТипов = Новый Массив;
	ЧастиТекстаПоля = Новый Массив;
	ЧастиИсточника = Новый Массив;
	ПараметрДобавлен = Ложь;	
	Для Каждого ТекущийТип Из РеквизитДокумента.ТипЗначения.Типы() Цикл
	
		ПолноеИмя = "";
		Если ТекущийТип = Тип("Строка") Тогда
			ЧастиТекстаПоля.Добавить(СтрШаблон("ЕстьNULL(&%1, """")", РеквизитДокумента.ИмяРеквизита));
			ИменаТипов.Добавить("Строка");
		ИначеЕсли ТекущийТип = Тип("Дата") Тогда
			ЧастиТекстаПоля.Добавить(СтрШаблон("ЕстьNULL(&%1, ДатаВремя(1,1,1))", РеквизитДокумента.ИмяРеквизита));
			ИменаТипов.Добавить("Дата");
		ИначеЕсли ТекущийТип = Тип("Число") Тогда
			ЧастиТекстаПоля.Добавить(СтрШаблон("ЕстьNULL(&%1, 0)", РеквизитДокумента.ИмяРеквизита));
			ИменаТипов.Добавить("Число");
		ИначеЕсли ТекущийТип = Тип("Булево") Тогда
			ЧастиТекстаПоля.Добавить(СтрШаблон("ЕстьNULL(&%1, ЛОЖЬ)", РеквизитДокумента.ИмяРеквизита));
			ИменаТипов.Добавить("Булево");
		ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТекущийТип) Тогда
			МетаданныеПеречисления = Метаданные.НайтиПоТипу(ТекущийТип);
			ПолноеИмя = МетаданныеПеречисления.ПолноеИмя();
		ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТекущийТип) Тогда
			Идентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТекущийТип);
			ПолноеИмя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Идентификатор, "ПолноеИмя");
		КонецЕсли;
		Если ПолноеИмя <> "" Тогда
			ИменаТипов.Добавить(ПолноеИмя);
			ЧастиТекстаПоля.Добавить(СтрШаблон("ЕстьNULL(Т%2.Ссылка, ЗНАЧЕНИЕ(%3.ПустаяСсылка))",
				РеквизитДокумента.ИмяРеквизита, СчетчикТаблиц, ПолноеИмя));
			ЧастиИсточника.Добавить(СтрШаблон("ЛЕВОЕ СОЕДИНЕНИЕ %3 КАК Т%2
					 |	ПО Т%2.Ссылка = &%1", РеквизитДокумента.ИмяРеквизита, СчетчикТаблиц, ПолноеИмя));
			
			Если Не ПараметрДобавлен Тогда		
				ПараметрСхемы = СхемаКомпоновки.Параметры.Добавить();
				ПараметрСхемы.Имя						= РеквизитДокумента.ИмяРеквизита;
				ПараметрСхемы.ТипЗначения				= РеквизитДокумента.ТипЗначения;
				ПараметрСхемы.ОграничениеИспользования	= Ложь;
				ПараметрДобавлен = Истина;
			КонецЕсли;
			СчетчикТаблиц = СчетчикТаблиц + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если ЧастиТекстаПоля.Количество() = 1 Тогда
		ТекстПоля = ЧастиТекстаПоля[0] + " КАК " + РеквизитДокумента.ИмяРеквизита;
		Если ЧастиИсточника.Количество() = 1 Тогда
			ТекстИсточника = ЧастиИсточника[0];
		КонецЕсли;
	ИначеЕсли ЧастиТекстаПоля.Количество() > 1 Тогда
		ЧастиКогда = Новый Массив;
		ТекстКогда = "
		|	КОГДА ТИПЗНАЧЕНИЯ(&%1) = ТИП(%2)
		|		ТОГДА %3";
		Для Индекс = 0 По ЧастиТекстаПоля.ВГраница() Цикл
			ЧастиКогда.Добавить(СтрШаблон(ТекстКогда, РеквизитДокумента.ИмяРеквизита, ИменаТипов[Индекс], ЧастиТекстаПоля[Индекс]));
		КонецЦикла;
		ТекстПоля = "ВЫБОР"
		+ СтрСоединить(ЧастиКогда)
		+ "
		|	ИНАЧЕ НЕОПРЕДЕЛЕНО
		|КОНЕЦ КАК " + РеквизитДокумента.ИмяРеквизита;
		Если ЧастиИсточника.Количество() > 0 Тогда
			ТекстИсточника = СтрСоединить(ЧастиИсточника, Символы.ПС);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ИнициализироватьОбщийМодуль(ИмяМодуля, ШаблонИсключения, ЗаголовокРасширения)
	Попытка
	
		ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
		Возврат Истина;
	
	Исключение
		
		ТекстИсключения = СтрШаблон(ШаблонИсключения, ИмяМодуля, ЗаголовокРасширения);
		ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииЧтениеДополнительныхМодулей(),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ТиповыеОперации,, ТекстИсключения);
		Возврат Ложь;
		
	КонецПопытки;
КонецФункции

Функция ТипЗначенияРеквизитаМетаданного(МетаданныеДокумента, ИмяРеквизита)

	РеквизитМетаданного = МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита);
	Если РеквизитМетаданного = Неопределено Тогда
		Для Индекс = 0 По МетаданныеДокумента.СтандартныеРеквизиты.Количество() - 1 Цикл
		
			Если ВРЕГ(МетаданныеДокумента.СтандартныеРеквизиты[Индекс].Имя) = ИмяРеквизита Тогда
				РеквизитМетаданного = МетаданныеДокумента.СтандартныеРеквизиты[Индекс];
				Прервать;
			КонецЕсли;
		
		КонецЦикла; 
	КонецЕсли;
	Если РеквизитМетаданного <> Неопределено Тогда
		Возврат РеквизитМетаданного.Тип;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции // ТипЗначенияРеквизитаМетаданного()

Процедура ДобавитьРекурсивноЭлементыДополнительнойТабличнойЧасти(ВыборкаЭлементы, Дерево, ТекущаяСсылка)

	Для каждого ВыборкаЭлементы Из ВыборкаЭлементы.Строки Цикл
		
		Если ВыборкаЭлементы.Ссылка = ТекущаяСсылка Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавленныйЭлемент = ДобавитьЭлементДополнительнойТабличнойЧасти(ВыборкаЭлементы, Дерево);
	
		Если ВыборкаЭлементы.ЭтоГруппа Тогда
			ДобавитьРекурсивноЭлементыДополнительнойТабличнойЧасти(ВыборкаЭлементы, ДобавленныйЭлемент, ВыборкаЭлементы.Ссылка);
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры

Функция ДобавитьЭлементДополнительнойТабличнойЧасти(ВыборкаЭлементы, Дерево)
	
	Если ВыборкаЭлементы.ЭтоГруппа Тогда
	
		НовыйЭлемент = Дерево.Строки.Добавить();
		НовыйЭлемент.Имя							= ВыборкаЭлементы.ИмяРеквизита;
		НовыйЭлемент.Заголовок						= ВыборкаЭлементы.ЗаголовокРеквизита;
		НовыйЭлемент.РастягиватьПоГоризонтали		= Истина;
		НовыйЭлемент.ТипЭлемента					= Новый ОписаниеТипов("ГруппаФормы");
		НовыйЭлемент.ВидЭлемента					= ВидГруппыФормы.ГруппаКолонок;
		НовыйЭлемент.ОтображатьЗаголовок			= Ложь;
		НовыйЭлемент.Группировка					= ГруппировкаКолонокТаблицыПоСтроке(ВыборкаЭлементы.ГруппировкаЭлементов);
		НовыйЭлемент.ШиринаПодчиненныхЭлементов		= ШиринаПодчиненныхЭлементовФормы.Авто;
		НовыйЭлемент.Отображение					= "Нет";
		НовыйЭлемент.НеПовторять					= Истина;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ВыборкаЭлементы.ТипЗначенияРеквизита) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		НовыйЭлемент = Дерево.Строки.Добавить();
		НовыйЭлемент.Имя 						= ВыборкаЭлементы.ИмяРеквизита;
		НовыйЭлемент.Заголовок 					= ВыборкаЭлементы.ЗаголовокРеквизита;
		НовыйЭлемент.РастягиватьПоГоризонтали	= Истина;
		НовыйЭлемент.ТипЭлемента 				= Новый ОписаниеТипов("ПолеФормы");
		НовыйЭлемент.ВидЭлемента 				= ВидПоляФормыПоСтроке(ВыборкаЭлементы.ВидЭлемента);
		НовыйЭлемент.Валютный 					= Ложь;
		НовыйЭлемент.НеПовторять 				= Истина;
		НовыйЭлемент.ТипЗначения				= ВыборкаЭлементы.ТипЗначенияРеквизита;
		НовыйЭлемент.СвязиПоТипу				= ВыборкаЭлементы.СвязьПоТипу;
		Если НЕ ПустаяСтрока(ВыборкаЭлементы.СвязиПараметровВыбора) Тогда
			МассивСвязей = ЗначениеИзСтрокиВнутр(ВыборкаЭлементы.СвязиПараметровВыбора);
			СвязиПараметровВыбора = Новый Массив;
			Для каждого ТекСвязь Из МассивСвязей Цикл
			
				СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора(	ТекСвязь.Имя,
																			ТекСвязь.Реквизит,
																			?(ТекСвязь.Режим = "НеИзменять",
																				РежимИзмененияСвязанногоЗначения.НеИзменять,
																				РежимИзмененияСвязанногоЗначения.Очищать)));
																			
			
			КонецЦикла; 
			
			НовыйЭлемент.СвязиПараметровВыбора	= СвязиПараметровВыбора;
		КонецЕсли;
		НовыйЭлемент.Путь 						= ?(ВыборкаЭлементы.ПредопределеннаяТЧ, "Объект.", "") + ВыборкаЭлементы.ИмяТЧ;
		НовыйЭлемент.Обязательный				= ВыборкаЭлементы.ОбязательныйРеквизит;
		НовыйЭлемент.ПоложениеЗаголовка			= ПоложениеЗаголовкаЭлементаФормы.Авто;
		НовыйЭлемент.ЦветФона					= Новый Цвет;
		НовыйЭлемент.ПриИзменении				= "Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти";
		Если Не ПустаяСтрока(ВыборкаЭлементы.СвязьПоТипу) Тогда
			Скобка = Найти(ВыборкаЭлементы.СвязьПоТипу, "(");
			Если Скобка > 0 Тогда
				// удалим из структуры связи по типу "Объект." для облегчения последующего поиска связанных элементов
				ВедущийЭлементИмя = Лев(ВыборкаЭлементы.СвязьПоТипу, Скобка-1);
				Если Лев(ВедущийЭлементИмя, 7) = "Объект." Тогда
					ВедущийЭлементИмя = Сред(ВедущийЭлементИмя, 8);
				КонецЕсли;
				ВедущийЭлементНомер = Сред(ВыборкаЭлементы.СвязьПоТипу, Скобка+1, 1);
				Если Число(ВедущийЭлементНомер) <> 0 Тогда
					СтруктураЗависимости = Новый Структура("ВедущийЭлемент, ПорядокЭлемента, ЗависимыйЭлемент, ЗависимостьПоДоступности, ЗависимостьПоЗаголовку",
															ВедущийЭлементИмя,
															ВедущийЭлементНомер,
															ВыборкаЭлементы.ИмяТЧ + "." + ВыборкаЭлементы.ИмяРеквизита,
															Истина,
															Истина);
					НовыйЭлемент.СтруктураСвязиПоТипу	= СтруктураЗависимости;
				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ПустаяСтрока(ВыборкаЭлементы.ОтборЭлементов) Тогда
			ПараметрыВыбора = Новый Массив;
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ПредустановленныйОтбор", ВыборкаЭлементы.ОтборЭлементов));
			// для перечислений добавим текст запроса для СКД обрабатываемой при получении списка выбора.
			Если Перечисления.ТипВсеСсылки().СодержитТип(ВыборкаЭлементы.ТипЗначенияРеквизита.Типы()[0]) Тогда
				ТекстЗапросаОтбора = "Выбрать * Из Перечисление."+Метаданные.НайтиПоТипу(ВыборкаЭлементы.ТипЗначенияРеквизита.Типы()[0]).Имя+" Как Переч";
				ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ТекстЗапросаОтбора", ТекстЗапросаОтбора));
			КонецЕсли;				
			НовыйЭлемент.ПараметрыВыбора			= ПараметрыВыбора;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция ВидПоляФормыПоСтроке(СтроковоеПредставление)

	Результат = ВидПоляФормы.ПолеВвода;
	Если СтроковоеПредставление = "ПолеФлажка" Тогда
		Результат = ВидПоляФормы.ПолеФлажка;
	КонецЕсли;
	Возврат Результат;

КонецФункции // ВидПоляФормыПоСтроке()

Функция ГруппировкаКолонокТаблицыПоСтроке(СтроковоеПредставление)
	Если СтроковоеПредставление = "Горизонтальная" Тогда
		Возврат ГруппировкаКолонок.Горизонтальная;
	ИначеЕсли СтроковоеПредставление = "ВЯчейке" Тогда
		Возврат ГруппировкаКолонок.ВЯчейке;
	Иначе
		Возврат ГруппировкаКолонок.Вертикальная;
	КонецЕсли;
Конецфункции

#КонецОбласти
